In [1]:
# Name: Kshirsagar Vaishnavi Anil
# Roll No.: TCOD73
# Batch: T12

In [2]:
import pandas as pd
import numpy as np
index = pd.date_range("1/1/2000", periods=8)

In [3]:
s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])

In [4]:
s

a    1.050607
b   -1.693851
c    0.423485
d   -1.061223
e   -0.903401
dtype: float64

In [5]:
df = pd.DataFrame(np.random.randn(8, 3), index=index, columns=["A", "B", "C"])
df

                   A         B         C
2000-01-01  1.817819  0.219594  2.177391
2000-01-02 -0.988363  1.113278 -0.462204
2000-01-03 -0.907222 -0.027632 -0.289477
2000-01-04 -0.165951  0.530952  0.444374
2000-01-05  0.524048 -0.434255 -1.128221
2000-01-06 -1.915218  1.025945 -0.782187
2000-01-07  0.557803  1.400274  0.857278
2000-01-08  0.057663  1.337916 -0.572607

In [6]:
df.head()

                   A         B         C
2000-01-01  1.817819  0.219594  2.177391
2000-01-02 -0.988363  1.113278 -0.462204
2000-01-03 -0.907222 -0.027632 -0.289477
2000-01-04 -0.165951  0.530952  0.444374
2000-01-05  0.524048 -0.434255 -1.128221

In [7]:
df.head(2)

                   A         B         C
2000-01-01  1.817819  0.219594  2.177391
2000-01-02 -0.988363  1.113278 -0.462204

In [8]:
df.tail()

                   A         B         C
2000-01-04 -0.165951  0.530952  0.444374
2000-01-05  0.524048 -0.434255 -1.128221
2000-01-06 -1.915218  1.025945 -0.782187
2000-01-07  0.557803  1.400274  0.857278
2000-01-08  0.057663  1.337916 -0.572607

In [9]:
df.tail(2)

                   A         B         C
2000-01-07  0.557803  1.400274  0.857278
2000-01-08  0.057663  1.337916 -0.572607

In [10]:
df = pd.DataFrame(
    {
        "one": pd.Series(np.random.randn(3), index=["a", "b", "c"]),
        "two": pd.Series(np.random.randn(4), index=["a", "b", "c", "d"]),
        "three": pd.Series(np.random.randn(3), index=["b", "c", "d"]),
    }
)
df

        one       two     three
a -1.265439 -0.101178       NaN
b -0.620755  1.479854 -1.432407
c -0.621948  0.765251 -0.042880
d       NaN -1.708188 -1.397043

In [11]:
df.sub(df.iloc[2], axis="columns")

        one       two     three
a -0.643491 -0.866429       NaN
b  0.001194  0.714603 -1.389527
c  0.000000  0.000000  0.000000
d       NaN -2.473439 -1.354163

In [12]:
df.sub(df.iloc[2], axis=1)

        one       two     three
a -0.643491 -0.866429       NaN
b  0.001194  0.714603 -1.389527
c  0.000000  0.000000  0.000000
d       NaN -2.473439 -1.354163

In [13]:
df.sub(df["one"], axis=0)

   one       two     three
a  0.0  1.164261       NaN
b  0.0  2.100609 -0.811652
c  0.0  1.387199  0.579069
d  NaN       NaN       NaN

In [14]:
df2 = df.copy()
df2

        one       two     three
a -1.265439 -0.101178       NaN
b -0.620755  1.479854 -1.432407
c -0.621948  0.765251 -0.042880
d       NaN -1.708188 -1.397043

In [15]:
df2.loc["d", "one"] = 0.08

In [16]:
df2

        one       two     three
a -1.265439 -0.101178       NaN
b -0.620755  1.479854 -1.432407
c -0.621948  0.765251 -0.042880
d  0.080000 -1.708188 -1.397043

In [17]:
df

        one       two     three
a -1.265439 -0.101178       NaN
b -0.620755  1.479854 -1.432407
c -0.621948  0.765251 -0.042880
d       NaN -1.708188 -1.397043

In [18]:
df.gt(df2)

     one    two  three
a  False  False  False
b  False  False  False
c  False  False  False
d  False  False  False

In [19]:
df.lt(df2)

     one    two  three
a  False  False  False
b  False  False  False
c  False  False  False
d  False  False  False

In [20]:
df.ge(df2)

     one   two  three
a   True  True  False
b   True  True   True
c   True  True   True
d  False  True   True

In [21]:
df.ne(df2)

     one    two  three
a  False  False   True
b  False  False  False
c  False  False  False
d   True  False  False

In [22]:
(df > 0).any()

one      False
two       True
three    False
dtype: bool

In [23]:
df

        one       two     three
a -1.265439 -0.101178       NaN
b -0.620755  1.479854 -1.432407
c -0.621948  0.765251 -0.042880
d       NaN -1.708188 -1.397043

In [24]:
df.loc["d"] = df.loc["a"].copy()

In [25]:
df

        one       two     three
a -1.265439 -0.101178       NaN
b -0.620755  1.479854 -1.432407
c -0.621948  0.765251 -0.042880
d -1.265439 -0.101178       NaN

In [26]:
s = pd.Series(["a", "b", "c"], dtype=object)
s

0    a
1    b
2    c
dtype: object

In [27]:
s[0]=None

In [28]:
s

0    None
1       b
2       c
dtype: object

In [29]:
s.iloc[0] = np.nan
s

0    NaN
1      b
2      c
dtype: object

In [30]:
ser1 = pd.Series([np.nan, np.nan, 2, 3])
ser2=pd.Series([np.nan, 1, np.nan, 4])

In [31]:
ser1

0    NaN
1    NaN
2    2.0
3    3.0
dtype: float64

In [32]:
ser2

0    NaN
1    1.0
2    NaN
3    4.0
dtype: float64

In [33]:
ser1+ser2

0    NaN
1    NaN
2    NaN
3    7.0
dtype: float64

In [34]:
pd.Series([1,2,3,4,5], dtype="float64").sum()

15.0

In [35]:
ser1

0    NaN
1    NaN
2    2.0
3    3.0
dtype: float64

In [36]:
ser1.dropna() #remove null val

2    2.0
3    3.0
dtype: float64

In [37]:
ser2

0    NaN
1    1.0
2    NaN
3    4.0
dtype: float64

In [38]:
ser2.fillna(999) # replace NA by 999

0    999.0
1      1.0
2    999.0
3      4.0
dtype: float64

In [40]:
data=pd.read_csv("StudentsPerformance.csv")

In [41]:
data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [42]:
df2=pd.DataFrame(data)
df2

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [43]:
df2.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [56]:
df2.tail()

,gender,NationalITy,PlaceofBirth,StageID,GradeID,SectionID,Topic,Semester,Relation,raisedhands,VisITedResources,AnnouncementsView,Discussion,ParentAnsweringSurvey,ParentschoolSatisfaction,StudentAbsenceDays,Class
475,F,Jordan,Jordan,MiddleSchool,G-08,A,Chemistry,S,Father,5,NaN,5,8,No,Bad,Above-7,L
476,F,Jordan,Jordan,MiddleSchool,G-08,A,Geology,F,Father,50,NaN,14,28,No,Bad,Under-7,M
477,F,Jordan,Jordan,MiddleSchool,G-08,A,Geology,S,Father,55,NaN,25,29,No,Bad,Under-7,M
478,F,Jordan,Jordan,MiddleSchool,G-08,A,History,F,Father,30,NaN,14,57,No,Bad,Above-7,L
479,F,Jordan,Jordan,MiddleSchool,G-08,A,NaN,S,Father,35,NaN,23,62,No,Bad,Above-7,L